---
title: VLANS
description: Networking
---
#### VLANs Cheat Sheet

<Callout>This guide provides a quick reference for VLAN configuration, trunking, and VLAN Trunking Protocol (VTP) commands on network switches.</Callout>

#### VLAN Configuration

#### VLAN Creation
To create a VLAN and assign it a name:
```shell
Switch(config)# vlan 100
Switch(config-vlan)# name Engineering
```
<Callout>VLAN 0: Reserved</Callout>
<Callout>VLAN 1: Default VLAN</Callout>
<Callout>VLAN 1002-1005: Legacy VLANs (e.g., fddi-default, tr, fdnet, trnet)</Callout>
<Callout>VLAN 1006-4094: Extended VLANs</Callout>
<Callout>VLAN 4095: Reserved</Callout>

#### Terminology

#### Trunking
<Callout>Trunking: Carrying multiple VLANs over the same physical connection.</Callout>
<Callout>Access VLAN: The VLAN to which an access port is assigned.</Callout>
<Callout>Voice VLAN: Supports voice traffic alongside data traffic on an access port.</Callout>

#### Access Port Configuration

To configure a switchport as an access port:
```shell
Switch(config-if)# switchport mode access
Switch(config-if)# switchport nonegotiate
Switch(config-if)# switchport access vlan 100
Switch(config-if)# switchport voice vlan 150
```

#### Trunk Port Configuration

To configure a switchport as a trunk:
```shell
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)# switchport trunk allowed vlan 10,20-30
Switch(config-if)# switchport trunk native vlan 10
```

#### Trunk Types

| Feature              | ISL           | 802.1Q       |
|----------------------|---------------|--------------|
| **Header Size**      | 26 bytes      | 4 bytes      |
| **Trailer Size**     | 4 bytes       | N/A          |
| **Standard**         | Cisco         | IEEE         |
| **Maximum VLANs**    | 1000          | 4094         |

<Callout>Native VLAN: By default, frames in this VLAN are untagged when sent across a trunk.</Callout>

#### Switch Port Modes

<Callout>trunk: Forms an unconditional trunk.</Callout>
<Callout>dynamic desirable: Attempts to negotiate a trunk with the far end.</Callout>
<Callout>dynamic auto: Forms a trunk only if requested by the far end.</Callout>
<Callout>access: Will never form a trunk.</Callout>

#### VLAN Trunking Protocol (VTP)

#### VTP Modes
<Callout>Server Mode: Generates and propagates VTP advertisements to clients. Default mode on unconfigured switches.</Callout>
<Callout>Client Mode: Receives and forwards advertisements from servers. VLANs cannot be manually configured on client mode switches.</Callout>
<Callout>Transparent Mode: Forwards advertisements but does not participate in VTP. VLANs must be configured manually.</Callout>

#### VTP Pruning
<Callout>Pruning: Removes VLANs from a trunk that do not have any access ports on an end switch, reducing flooded traffic.</Callout>

#### VTP Configuration

To configure VTP settings:
```shell
Switch(config)# vtp mode {server | client | transparent}
Switch(config)# vtp domain <name>
Switch(config)# vtp password <password>
Switch(config)# vtp version {1 | 2}
Switch(config)# vtp pruning
```

#### Troubleshooting

To display VLAN-related information:
```shell
Switch# show vlan
Switch# show interface [status | switchport]
Switch# show interface trunk
Switch# show vtp status
Switch# show vtp password
```

#### SVI (Switched Virtual Interface) Configuration

To configure an SVI as a routed gateway for a VLAN:
```shell
Switch(config)# interface vlan100
Switch(config-if)# ip address 192.168.100.1 255.255.255.0
```

